Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/radio_board/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash — 4 MB, which is the smallest standard size that fits this project's
# own partition table (partitions.csv ends at 0x320000, 3.2 MB). That is the
# rule for every build in the tree since #916/#1314, owner decision 2026-09-09,
# and `tinkerrocket-idf/tools/check_flash_declarations.py` enforces it in CI —
# so this line is machine-checked and does not need defending in prose.
#
# Why that direction: over-declaring is the only failure that bricks. The
# bootloader reads a size the chip does not have and the board loops before
# app_main, where no runtime assertion can reach it. Under-declaring is
# harmless — the boot log says so out loud ("Detected size(8192k) larger than
# the size in the binary image header(4096k)") and carries on.
#
# READ THIS BEFORE "FIXING" THE NUMBER. Everything below this line used to be
# a long argument for 8 MB, ending "THE 8 MB DECLARATION STAYS". #1314 changed
# the declaration to 4 MB and left that argument standing, so the file spent a
# day asserting one thing and doing another — which is exactly the shape that
# invites someone to flip the line back and quietly undo the rule. The 8 MB
# reasoning is not wrong so much as superseded: 8 MB was chosen as the value
# that boots on both an 8 MB and a 16 MB part, and 4 MB satisfies that same
# requirement strictly better while also fitting a 4 MB bench devkit.
#
# The part fitted is NOT the input to this number. Do not raise it to match a
# schematic, a BOM, or a chip you read off a board — that is the #492 mistake
# (the OC's 128-of-512 MB field) in a place where it bricks instead of merely
# misreporting. If this project ever outgrows 3.2 MB, grow partitions.csv and
# let the guard tell you the new size.
#
# THE FLEET IS MIXED, and that is not an argument against the above — it is why
# a single conservative declaration is right for a project with no
# board-revision flag to fork on. Measured, four articles so far:
#
#   V8 pair  E0:72:A1:CA:F6:7C   8 MB  (GigaDevice c8:6517)
#   V9 pair  E0:72:A1:CA:F6:40  16 MB
#            E0:72:A1:CA:F6:48   8 MB  (GigaDevice c8:6517) — bench 2026-09-10
#   first article  ...:F6:50           — unflashable, boot NOR never answers
#
# The first article's failure is NOT true of every 16 MB board: its siblings
# flash and boot first time. Do not repeat that claim.
#
# If this project ever does need a per-board size, give it the TR_BOARD_*-style
# flag and sdkconfig.defaults.<rev> overlay that flight_computer and
# out_computer use, rather than flipping this line.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM stays OFF — hardware constraint, not a preference, and it holds for
# both board revisions for different reasons. The as-built board fits a plain
# ESP32-S3 (no in-package PSRAM, so there is nothing to enable). The revision
# that fits an S3RH2 has 2 MB of quad PSRAM hanging on VDD_SPI, which in 3.3 V
# mode is fed internally from VDD3P3_RTC through ~14 ohm — and the external
# boot flash shares that node. Flash alone (~25 mA) holds ~2.95 V; flash +
# PSRAM active (~50 mA) sags to ~2.60 V, below both parts' 2.7 V minimum, i.e.
# enabling PSRAM browns out the chip's own boot flash. Do not turn this on
# unless VDD_SPI is re-fed (hardware pre-fab review finding 4).
CONFIG_SPIRAM=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Interrupt WDT
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# Core dump to flash — retrieve after crash with:
#   espcoredump.py info_corefile -t raw -c 0x310000 build/radio_board.elf
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial console on USB (the UART link owns the host pins)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
